<template>
  <div class="questions container">
    <h1>よくある質問</h1><br>

    <h2>ツイートしたのに集計されていません</h2>
    <p>集計が行われない原因として、以下の5つが考えられます。
    DMにて、集計されなかった旨ご連絡いただければ、個別に対応いたします。</p>

    <h3>原因1:タグの付け忘れ</h3>
    <p><b>#リングフィットアドベンチャー</b> のタグを付けた上で、ツイートを投稿してください。</p>

    <h3>原因2:画像のサイズや種類が異なる</h3>
    <p><b>本日の運動結果</b> のスクリーンショットを投稿してください。そのほかの画像は読み取れません。<br>
    また、画像の大きさは1280x720でないと、読み取れません。<br>
    Switchから直接投稿すれば、正しく読み取れるはずですが、画像をスマホに移した場合等に、画像サイズが縮小されるケースがありますので、ご確認ください。</p>

    <h3>原因3:鍵アカウントである</h3>
    <p>鍵アカウントは集計の対象外になります。</p>

    <h3>原因4:シャドウバンにより、集計から除外されている</h3>
    <p>Twitterでは検索結果から不適切なアカウント・ツイートを除外するアルゴリズムがあります。
    この仕組みはシャドウバンと呼ばれ、シャドウバンされると検索結果に反映されなくなり、集計されなくなってしまいます。
    シャドウバンされているかどうかは以下のリンクのサービスでご確認ください。</p>
    <p><a href="https://shadowban.eu/">https://shadowban.eu/</a></p>

    <h3>原因5:RingFitRankerのバグ・不具合</h3>
    <p>上記の条件に当てはまらない場合、RingFitRankerが不具合を起こしている可能性があります。ぜひともDMにてお知らせください。</p>

    <h2>リプライ時の順位と、TOP10発表時の順位が異なるのはなぜですか？</h2>
    <p>リプライ時の順位はフォロワー外含んだ全数の集計になっていて、
    TOP10の発表はフォロワー限定になっています。</p>

    <h2>鍵アカウントはランキング集計の対象になりますか？</h2>
    <p>鍵アカウントは、集計・リプライの対象にはなりません。</p>

    <h2>そのほかの質問・機能追加の要望や改善要求など</h2>
    <p>TwitterアカウントのDMからお問い合わせください。</p>
  </div>
</template>
